# 4.9 Intro to Data Visualization with Python Task Part 1

# Contents

### 1. Importing Libaries and Data

### 2. Renaming columns (Data Wranggling)

### 3. Data Quality and Consistency Checks

### 3.1 Creating a new data frame with only non-missing values

### 3.2 Missing Values and Duplicates

### 3.3 Checking for mixed-type data

# Script

### 1. Importing Libaries and Data

In [1]:
#import libaries 

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# defining path
path = r'C:\Users\tinar\OneDrive\Dokumente\00 DATA ANALYST Carrer Foundry\04 Immersion Course\4. Python Fundamentals for Data Analysts\2209 Instacart Basket Analysis'

In [3]:
# import new customer data set into Jupyter as a new dataframe:
customer = pd.read_csv(os.path.join(path, '02 Data', '01 Original Data', 'customers', 'customers.csv'), index_col = False)

In [9]:
customer.head()

,user_id,first_name,Surnam,gender,state,age,date_joined,familiy_members,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### 2. Renaming columns (Data Wranggling)

### 4. Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [10]:
#renaming columns
customer.rename(columns = {'First Name' : 'first_name'}, inplace = True)
customer.rename(columns = {'Surnam' : 'last_name'}, inplace = True)
customer.rename(columns = {'Gender' : 'gender'}, inplace = True)
customer.rename(columns = {'STATE' : 'state'}, inplace = True)
customer.rename(columns = {'Age' : 'age'}, inplace = True)
customer.rename(columns = {'n_dependants' : 'familiy_members'}, inplace = True)

In [11]:
customer.head()

,user_id,first_name,last_name,gender,state,age,date_joined,familiy_members,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### 3. Data Quality and Consistency Checks

### 5. Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

#### Finding Missing Values

In [12]:
# sum function show how many total missing observations there are / 
# here the only column with missing values is the "product_name" column, and it’s missing 16 values.
customer.isnull().sum()

user_id                0
first_name         11259
last_name              0
gender                 0
state                  0
age                    0
date_joined            0
familiy_members        0
fam_status             0
income                 0
dtype: int64

#### There are 11259 missing first names

In [13]:
customer.shape #11259 names out of 206209 are missing 0 ca. 5%

(206209, 10)

In [14]:
# Create a new variable that acts like a flag based on the missing value
# Impute the value with the mean or median of the column (if the variable is numeric).- NO 
# Remove or filter out the missing data

In [15]:
#Even though I think the missing first name is not so important I will create a subset exclusing the missing values

### Creating a new data frame with only non-missing values

In [16]:
customer = customer[customer['first_name'].isnull() == False]

In [17]:
customer.isnull().sum()

user_id            0
first_name         0
last_name          0
gender             0
state              0
age                0
date_joined        0
familiy_members    0
fam_status         0
income             0
dtype: int64

### Checking for duplicates

In [34]:
customer[customer.duplicated()]

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, familiy_members, fam_status, income]
Index: []

### No duplicates

### Checking for mixed-type data

In [20]:
for col in customer.columns.tolist():
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customer[weird]) > 0:
    print (col)

In [ ]:
df = customer.dtypes #view the data type for each column in a dataframe

In [22]:
df

user_id             int64
first_name         object
last_name          object
gender             object
state              object
age                 int64
date_joined        object
familiy_members     int64
fam_status         object
income              int64
dtype: object

### no mixed-type data

### 6. Combine your customer data with the rest of your prepared Instacart data. Tip: Make sure the key columns are of the same data type! Hint: Make sure the key columns are the same data type!

In [23]:
# import of orders_products_merged (prepared instacart data) from 4.8
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data','02 Prepared Data','orders_products_merged_48.pkl'))

In [38]:
ords_prods_merge.dtypes

order_id                            int64
user_id                            object
order_number                        int64
order_dow                           int64
order_hour_of_day                   int64
days_since_prior_order            float64
product_id                          int64
add_to_cart_order                   int64
reordered                           int64
product_name                       object
aisle_id                            int64
department_id                       int64
prices                            float64
_merge                           category
price_range_loc                    object
busiest_day                        object
busiest_days                       object
busiest_time_of_the_day            object
max_order                           int64
loyalty_flag                       object
avg_price                         float64
spender_flag                       object
median_days_since_prior_order     float64
frequency_flag                     object
dtype: object

### In customer user_id is a integer and in ords_prods user_id is an object

In [41]:
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [43]:
customer['user_id'] = customer['user_id'].astype('str')

In [44]:
ords_prods_custo = ords_prods_merge.merge(customer, on = 'user_id')

In [45]:
ords_prods_custo.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,frequency_flag,first_name,last_name,gender,state,age,date_joined,familiy_members,fam_status,income
0,2539329,1,1,2,8,11.11484,196,1,0,Soda,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.00000,196,1,1,Soda,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.00000,196,1,1,Soda,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.00000,196,1,1,Soda,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.00000,196,1,1,Soda,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [46]:
ords_prods_custo.rename(columns = {'order_dow' : 'orders_day_of_week'}, inplace = True)

In [47]:
ords_prods_custo.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,frequency_flag,first_name,last_name,gender,state,age,date_joined,familiy_members,fam_status,income
0,2539329,1,1,2,8,11.11484,196,1,0,Soda,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.00000,196,1,1,Soda,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.00000,196,1,1,Soda,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.00000,196,1,1,Soda,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.00000,196,1,1,Soda,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [48]:
ords_prods_custo['_merge'].value_counts() #Using the value_counts() function lets you quickly sum up all the values in the “_merge” column, letting you see instantly whether you have a full match or not.

both          30629741
left_only            0
right_only           0
Name: _merge, dtype: int64

In [ ]:
# Export new merged file as pkl
ords_prods_custo.to_pickle(os.path.join(path, '02 Data','02 Prepared Data', 'instacart_data_complete.pkl'))